Tekla.Structures.ModelInternal.dotBuildingHierarchyGetObjectsOperation_t
Data structure for Building Hierarchy data retrieval operations.

Tekla.Structures.ModelInternal.dotBuildingHierarchyGetObjectsOperation_t.ClientId
Client id for data retrieval operation (used for getting string lists).

Tekla.Structures.ModelInternal.dotBuildingHierarchyGetObjectsOperation_t.aParentGuid
Guid of the Building Hierarchy parent object.

Tekla.Structures.ModelInternal.dotBuildingHierarchyGetObjectsOperation_t.ParentType
Item type of the Building Hierarchy parent object.